# Pandas used for data cleaning manipulation selection and data wrangling ,visulization

In [43]:
import pandas as pd

In [44]:
# load data 
df = pd.read_csv("employees.csv")

# Inspect

In [45]:
df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-JUN-07,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,DGRANT,650.507.9844,13-JAN-08,SH_CLERK,2600,-,124,50
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,17-SEP-03,AD_ASST,4400,-,101,10
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,17-FEB-04,MK_MAN,13000,-,100,20
4,202,Pat,Fay,PFAY,603.123.6666,17-AUG-05,MK_REP,6000,-,201,20

In [ ]:
df.info()

# Select columns/rows

In [ ]:
df[['EMPLOYEE_ID','FIRST_NAME','SALARY']].head(7)

In [ ]:
df[['EMPLOYEE_ID','FIRST_NAME','SALARY']].tail(3)

In [ ]:
df[['EMPLOYEE_ID','FIRST_NAME','SALARY','EMAIL']].info()

# iloc
rows 0:5             #rows from 0 50 5 
Columns 0:4          #columns from 0 to 4

In [ ]:
df.iloc[0:5,1:4]

# loc 
rows 0:2             #start from 0 go till row 2
Column 'SALARY'       #Single column
create list if want multiple columns

In [ ]:
df.loc[0:2,["SALARY","FIRST_NAME","EMAIL"]]

   SALARY FIRST_NAME     EMAIL
0    2600     Donald  DOCONNEL
1    2600    Douglas    DGRANT
2    4400   Jennifer   JWHALEN

In [58]:
df.loc[df ['SALARY'] > 13000]

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
9,100,Steven,King,SKING,515.123.4567,17-JUN-03,AD_PRES,24000,-,-,90
10,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21-SEP-05,AD_VP,17000,-,100,90
11,102,Lex,De Haan,LDEHAAN,515.123.4569,13-JAN-01,AD_VP,17000,-,100,90

# Handlling missing values

In [ ]:
df.isna()